In [1]:
import numpy as np 
import pandas as pd

In [14]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc',
                         'def',
                          'ghi',
                          'xyz']})

In [15]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Unique Values

In [4]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
df['col2'].nunique()

3

In [6]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# Applying Functions

In [7]:
def t2(x):
    return x*2

In [8]:
t2(9)

18

In [9]:
df['col1'].apply(t2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [16]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [30]:
df['col2'].apply(lambda f : f**0.5)

0    21.071308
1    23.558438
2    25.806976
3    21.071308
Name: col2, dtype: float64

# Permanently Removing Column

del df['col1]

In [22]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [23]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Sorting and Ordering DataFrame

In [24]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [26]:
df.sort_values(by='col2', ascending= False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [27]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes